{
"About": {
  "Name": "Drew Fleming",
  "Currently": "Electrical Engineering Student",
  "Headshot": "Drew headshot.png",
  "Thumbnail": "DF logo.png",
  "AboutText": "Hi, I am Andrew Fleming. I am an electrical engineering student at Seattle Pacific University with a growing passion for software and hardware working together. I like digging into projects where I can actually build something that works, whether that is a control system, a microgrid idea, or a piece of code that solves a problem I have been wrestling with. I enjoy learning new tools and figuring things out as I go. Most of my best work has come from collaborating with classmates and bouncing ideas around until something clicks. Outside of class I usually end up working on side projects or helping friends with their own builds because I like seeing how different people approach problems. I care a lot about growing my skills and staying curious, and I try to take every chance I get to learn something new."
},
"Contact": {
  "EMail": "fleminga3@spu.edu",
  "Phone": "(206) 602-7540",
  "LinkedIn": "https://www.linkedin.com/in/drew-fleming-a90173244/",
  "GitHub": "https://www.github.com"
},
"Experience": {
  "ExperienceText": "I have grown a lot by taking on projects that stretch me, especially my current work building a small-scale airborne wind generator for my senior design project. It has pushed my skills in power systems, controls, and real hands on problem solving. I am wrapping up my final year and getting ready to step into a career in sustainable energy, confident in the work I have done and the direction I am heading.",
  "School": "Seattle Pacific University",
  "Major": "Electrical Engineering",
  "Graduation": "June 2026",
  "EducationText": "I am a senior Electrical Engineering student at Seattle Pacific University, minoring in Appropriate and Sustainable Engineering. My coursework in electronics, signals, and microgrids has shaped how I approach real engineering problems, and my roles as a Lead Resident Advisor and IEEE Vice President have strengthened my communication and leadership. My studies also led me into airborne wind energy research, which I am continuing through my small scale airborne wind generator project.",
  "Employment": "Seattle Pacific University",
  "Role": "Resident Advisor",
  "Skills": ["C++", " Matlab", " Multisim", " Autocad"],
  "Resume": "Andrew Fleming (1).pdf"  
},
"Project1": {
    "Title": "Personal Weather Probe",
    "Desc": "For my Junior Design project, I made a water weather probe that autonomously collected water temperature at various depths. ",
    "GitHubRepo": "",
    "MainImage": "PWP main picture.png",
    "DetailImages": ["PWP electrical.png","PWP electircal in box.png","PWP open top.png"]
  },
  "Project2": {
    "Title": "Laser Tag Blasters",
    "Desc": "I designed laser tag blasters for my microcontroller class. They used a Raspberry Pico Pi and infared lasers to shoot. They had a safety system and a speaker that buzzed when you shot someone or got shot.",
    "GitHubRepo": "",
    "MainImage": "LTmain.png",
    "DetailImages": ["LT disp.png","laser infared.png"]
  },
  "Project3": {
    "Title": "PCB Design",
    "Desc": "I designed and built a custom PCB for a dual adjustable power supply, handling the full schematic and board layout in Altium. I chose the components, routed the power and control sections, and refined the layout for safe and stable voltage regulation. After fabrication, I assembled and soldered the entire board, producing a reliable custom power system.",
    "GitHubRepo": "",
    "MainImage": "PCB main.png",
    "DetailImages": ["PCB breadboard.png","PCB multisim.png","PCB layout"]
  },
  "Project4": {
    "Title": "",
    "Desc": "",
    "GitHubRepo": "",
    "MainImage": "",
    "DetailImages": []
  }
}
